Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToIncorrectTypeException
The CannotSetAttributeForPluginDueToIncorrectTypeException class defines the exception that is
thrown when Plugin.SetAttribute is called but the type is incorrect.

Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToIncorrectTypeException.#ctor
Creates a new CannotSetAttributeForPluginDueToIncorrectTypeException instance.

Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToIncorrectTypeException.#ctor(System.Type,System.Type)
Creates a new CannotSetAttributeForPluginDueToIncorrectTypeException instance.
ExpectedType: The expected type.
GivenType: The given type.

Tekla.Structures.Drawing.CannotSetAttributeForPluginDueToIncorrectTypeException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.